export const RULE_CONFIG={
  psspace_str:/^\s*\s*$/,/*前后空格*/
  space_str:/\s*/g,/*所有空格*/
  char_str:/\s*\D*/g,/*包含空格的字符*/
  bankcard_str:/^(\d{16}|\d{19})$/,/*银行卡号*/
  mobile_str:/^(13[0-9]|14[579]|15[012356789]|16[6]|17[01235678]|18[0-9]|19[89])[0-9]{8}$/,/*手机号码*/
  number_str:/^[0-9]{0,}$/g,/*数字(可为空)*/
  html_str:/^(?:[^#<]*(<[\w\W]+>)[^>]*$|#([\w\-]*)$)/,/*html*/
  illegal_str:/[`~!@#$%^&*()_+<>?:"{},.\/;'[\]！￥…（）——《》？：“”，。；：’‘、【】]/ig,/*非法字符*/
  illegalentity_str:/(&#34;|&quot;|&#60;|&lt;|&#62;|&gt;|&#160;|&#180;|&acute;)/ig,/*非法实体字符*/
  illegalhtml_str:/["'\/！￥…（）——《》？：“”，。；：’‘、【】]/ig/*非法html字符*/
};
